{
  "id": "922dbfdb-1526-40bb-8212-7e4a84fa9694",
  "Title": "Copyright, Trademarks, Patents, and Branding yourself online with Yasmine Salem Hamdan",
  "PublishDate": "2019-05-09",
  "PodcastURL": "https://dts.podtrac.com/redirect.mp3/audio.simplecast.com/9f369e9a.mp3",
  "TranscriptionSegments": [
    {
      "Sentence": "Would you like to write code faster and smarter with rich code completion in clever code analysis? Find anything in a solution instantly? What if you could easily explore and run tests work with git material or TFS seamlessly. Anri factor in a few clicks. All this and more is available in jet brains riderA.net ID for Windows, Mac and Linux try. It free for 30 days get writer today at RIDERIDE.net that'swriter.net.",
      "Duration": 33,
      "Offset": 0
    },
    {
      "Sentence": "Hi this is Scott Hanselman. This is another episode of cats minutes, and today I'm talking with Jasmine save on Honda lawyer and Y SH law firm and I found you on Instagram at startup lawyer. Lady you're very technically savvy for a lawyer. If you forgive me, saying that I get this impression that lawyers are faxing things and doing things with regular paper. I hate to break it to you. Many of us still are but some of us are trying to as you could say get with the Times so yeah.",
      "Duration": 33,
      "Offset": 42
    },
    {
      "Sentence": "Find myself and that why is it that we like the public or the techies in the public have a feeling like lawyers are stuck in the past when we hear about like people still faxing stuff, but there seems to be a new generation of lawyer that maybe is getting more technical. Yeah, you know, I wish I could. I wish I had an answer to that question Scott there are.",
      "Duration": 23,
      "Offset": 76
    },
    {
      "Sentence": "It might be a matter of Uh, I don't know a couple different factors are coming to mind so the law itself. No, the practice of law and the law. That's on the books. I mean that takes a lot of time for it to change and to catch up and so technology moves so quickly and the law and legislation itself in order for that to be enacted and you know just proposed in general and goes through the process that it is required to go through that takes years. You know, and as you and I are both familiar with.",
      "Duration": 31,
      "Offset": 100
    },
    {
      "Sentence": "In a general sense it moves very quickly right so technology from a year ago. Maybe outdated at this point right whereas there are laws on the books from 30, plus years ago. Some are still applicable in summer. Not and that's just sort of the nature of it and I'd like to think that the law will catch up. But the practice of law. Certainly has changed a lot in the last last decade. Certainly in the last 2 decades. I'd say, and the practice of law itself with the introduction of technology and.",
      "Duration": 32,
      "Offset": 132
    },
    {
      "Sentence": "You said the Internet and certainly social media in with marketing in recent years. That's just transformed the way that clients and attorneys are communicating and so, yeah, I came in on it at a pretty good time. I'd say one of the things that I've noticed as a consumer of Legal Services is in the last maybe decade or so. The thing is most significant to me is the idea of digital signatures using doc you sign and things like that did that just happen because the industry demanded it.",
      "Duration": 31,
      "Offset": 165
    },
    {
      "Sentence": "It was there some, like president or something was like, yeah, this person clicked on this PDF. Therefore it's their signature like? When did that decision happen if someone said there was a thing? Yeah, that's a great question I'd not sure when exactly it happened, I would say my guess is that it happened in the age of the Internet. But it's interesting that you bring that up is that is. It just because somebody clicked on this PDF and that means it's a signature. I remember back in law school when I studied estate planning and.",
      "Duration": 32,
      "Offset": 197
    },
    {
      "Sentence": "Of Wills and trusts and things like that, for individuals there. There is some sort of statute in the state of Texas, where if you just make if that individual just create some sort of marking it doesn't necessarily have to be their actual signature or even their name. It could be some sort of marking and that constitutes as a signature or authorization if they're granting authorization or whatever it might be agreement contract.",
      "Duration": 30,
      "Offset": 230
    },
    {
      "Sentence": "And so I think it's I think the market demanded it because of Faxing becoming a thing of the past, someone I don't own a fax machine. But I know most Law Offices do have fax machines and court still use fax machines and when I hear it. When I deal with the court and they don't have use E mail and like what? What how how is this possible but it is right?",
      "Duration": 30,
      "Offset": 260
    },
    {
      "Sentence": "It's also a matter of investing you know the resources in bringing things up to date, which Hey in in their minds. It might be a matter of if it's not broke and we're not going to fix it. You know it. Works just fine. Everybody knows how we operate will keep doing it until we can't anymore. And I guess. Nobody's objected at this point. So yeah, I don't. I don't know when that came about. But that's a great question. I find it comforting that you don't have a fax machine somehow. I just imagine that dollar faxing.",
      "Duration": 31,
      "Offset": 292
    },
    {
      "Sentence": "You know there are multiple times room like I really need to get a fax machine. But I haven't yet so I've made it this long without investing in AA ring forest rather to purchase a fax machine. But yeah, and then it's so it's so ridiculous that sometimes don't make us like do like an efax and it's like all this technology just so I can end up giving you a fake piece of paper so many ways. We could communicate and this is your this is your method of choice. So so one of your specialties at Y SH firm.",
      "Duration": 31,
      "Offset": 324
    },
    {
      "Sentence": "Dot com is helping people out with their startups with their ideas. You know all the legal support when someone has an idea and they want to make that thing happen. An I realized that if someone quizzed me and said what's the difference between a trademark Copyright and patent.",
      "Duration": 13,
      "Offset": 356
    },
    {
      "Sentence": "I would probably have a very long awkward pause and I'm like well. I mean, patent that's like the most important thing. Maybe you could help me understand understand those things. Yeah, absolutely so those are the 3 main types of intellectual property so as far as we could take a step back. The difference between intellectual property and real property, so real property. Those are tangible things like you know. Maybe it's a building. Maybe it's personal property. Maybe it's a piece of land.",
      "Duration": 30,
      "Offset": 370
    },
    {
      "Sentence": "Things that you can touch and See and feel right now, intellectual property. Um that is more so intangible. So we've got those like you mentioned Scott. We've got patents. We've got trademarks without copyrights so patents.",
      "Duration": 14,
      "Offset": 401
    },
    {
      "Sentence": "Our rights that are granted to the original inventor of the invention by the US government and it gives that owner, the right to exclude others from using or profiting from that invention an it's a limited period of time right so there isn't a perpetual grant in the right to create whatever intent to reproduce it or or use it or profit from it.",
      "Duration": 30,
      "Offset": 416
    },
    {
      "Sentence": "Yes, it's for a period of 20 years, OK and so after the 20 years. It's sort of a free for all but for that period of 20 years that individual that inventor has the right to reproduce it profit off of it imported from out of the country. You know really just have control over the use of the reproduction of that invention. It's got to be something that is novel should be non obvious and Nonfunctional and so I'm not a patent attorney. These are each each of these areas that I'm going to go into Copyright and trademarks in a little bit.",
      "Duration": 33,
      "Offset": 446
    },
    {
      "Sentence": "There's a very complex as you can imagine right so my focus is on trademark law and that's really where I that's really where I work with my clients and developing solid trademark assets and then taking the steps necessary to protect them and So what A TM is is a source identifier and so as a business as a start up as a brand. You have source identifiers that you're using in Commerce to identify the source of the goods and services that you're selling.",
      "Duration": 30,
      "Offset": 481
    },
    {
      "Sentence": "So a good example. I like to use this Nike because everyone recognizes Nike. We're all familiar with the brand Nike. Nike is the brand name that is their trademark. They're using the word. Mark Nike to identify the source of the goods that they sell another trademark. They have is their logo and that is that swoosh symbol write the check. Mark you see the switch symbol on a pair of track pants or you see it on, you know a shirt or a basketball or whatever it may be you automatically recognize that that the source of that product is.",
      "Duration": 30,
      "Offset": 512
    },
    {
      "Sentence": "The Nike right and you associate certain things with that, so you associate a certain level of quality right with a Brandon with that product when you see the trademark on you know the product is bearing that trademark and connecting itself with the with the source which ultimately here is Nike and then you know they've got their slogan, which is another TM. I would just just do it right. We're all familiar with that, you here. Just do it, you see just do it, you automatically associate whatever it is that you're seeing.",
      "Duration": 31,
      "Offset": 543
    },
    {
      "Sentence": "With the company Nike and again, you're that brings to mind. You know certain level of quality. Maybe of philanthropy and and whatever that might be. And so that's really where I focus my energies in my time in working with my clients and we'll talk more in depth on that in a little bit. I'm sure, but the third kind of piece of intellectual property is copyrights. And so with copyrights that is the right and the ownership in an original work of art or authorship and so.",
      "Duration": 30,
      "Offset": 576
    },
    {
      "Sentence": "The Copyright so that you might have within your business might be photography. Video Ography written word so if you've got a blague. If you've got like yourself, you have your podcast so you have ownership in the audio files, the recordings. These are original works of art or authorship and so as a Copyright owner. You have the right to reproduce it. You have the right to create derivative works. Based on it, you have the right to authorize others to use it or benefit from it.",
      "Duration": 32,
      "Offset": 607
    },
    {
      "Sentence": "And so that means you could license it to others. You could develop derivative works in terms of you have a podcast recording. You could create written works based on that, like a transcription. You could develop maybe graphics based on you know, including the quotes that you're pulling from these recordings and so it's a wide range of rights that you have as the owner in the law. They refer to as the bundle of sticks and so you could always separate the bundle of sticks, I might decide like I'm going to grant you the right to license this to others, but I'm still going to maintain ownership over the Copyright.",
      "Duration": 34,
      "Offset": 640
    },
    {
      "Sentence": "You can you could probably imagine how all of these assets are valuable within a business and within a startup and how you want to make sure that you're taking the steps necessary to protect your assets from infringers because as I'm sure you know, people start popping out the woodwork when you create something you know fabulous. They want to reproduce it. They want to replicate it and they try. But you have to make sure that you're enforcing your rights.",
      "Duration": 32,
      "Offset": 675
    },
    {
      "Sentence": "Don't become diluted OK, so then in order to have Copyright protection something must be original so you and I are on this podcast, having a conversation which is presumably original so it's it's a tangible medium where that tangible medium is this MP 3 other people are listening to right now and it's in a fixed form. I can make it a transcript or a book or whatever, but you're talking the most. I'm hosting the podcast you own your words, but I own the Copyright even though you're saying cool stuff.",
      "Duration": 34,
      "Offset": 709
    },
    {
      "Sentence": "You and I have a big fight and you could say Hey, Scott, stop talking stop, making T-shirts about something that Yasmeen said on the podcast that was really amazing. There's a lot of gray area in the world of intellectual property right so let's say you created AT shirt and you've got this T shirt design and you develop the design, but the words are mine and so then the design. You have Copyright ownership in that, but the words if they are original words that I strung together.",
      "Duration": 30,
      "Offset": 744
    },
    {
      "Sentence": "I'd say, you drop the knowledge on this show right not just randomly when you're having coffee. But like while we were recording, yeah, so the recording since you develop the recording. You would have presumably Copyright ownership in the recording. Now I have some clients that are.",
      "Duration": 18,
      "Offset": 775
    },
    {
      "Sentence": "That have podcasts an we develop contracts that make it very clear who owns what and that as the podcast producer and host that you are granted a license from me as the guest to reproduce these recordings and to reproduce the content that we've discussed and that is here. In this tangible medium. And so, yeah, it's the best case scenarios, you want to make sure that.",
      "Duration": 30,
      "Offset": 794
    },
    {
      "Sentence": "Agree so that you are clear on what your rights are and you don't find yourself. In some hot water later on where you might say OK well. You know, Jasmine said some really cool. Things I want to share with others because I think it will be useful to them. You want to make sure that Jasmine has granted you the right to do so and then that way. I don't come back later on, and say, Well wait a second you know you're making a lot of money off of what I shared with you and I want some of that right. You don't wanna deal with that unnecessarily and so that way and that's",
      "Duration": 30,
      "Offset": 825
    },
    {
      "Sentence": "Um just sort of as a general principle that I share with my clients and with my audiences that you really want to be proactive when it comes to protecting your intellectual property and protecting your business. You don't want to deal with doing that damage control. Later on or having to deal with a lawsuit or hiring a lawyer to defend you in that sort of case you really it suits you best as a business owner, so that you're able to preserve your energies and focus that on developing your business and really operating within your zone is.",
      "Duration": 30,
      "Offset": 856
    },
    {
      "Sentence": "Instead of having to invest that in OK. Let me clean up this mess that could have been avoided well. How do we find that balance. Though I feel like? I'm kind of pulling it out and put it all out there I've done almost 700 episodes over 13 years. I haven't had an issue yet, but now you're making me think maybe I should hire a lawyer have someone fill out like a little doc you sign before they do. The show, but then I might turn them off right. I mean, we, as regular people and I'm not trying to other you as a lawyer. But we",
      "Duration": 30,
      "Offset": 887
    },
    {
      "Sentence": "For non lawyers CIA contractor like Oh, I don't want to do your podcast 'cause you're going to make me sign something it's like when your friend says Hey. Let's have coffee, but sign this NDA first and it's like Well, you know, either were friends are wasted in da but not both we need a contract for doing podcasts? Are you required to have one by the law. No would it benefit you in benefit the other party to clearly outline what the relationship is yes, absolutely that can help mitigate.",
      "Duration": 30,
      "Offset": 918
    },
    {
      "Sentence": "Yeah, disagreements are miscommunications that or even harder later on exactly or even hard feelings. You know, and making sure that it's very clear what's taking place here and we see this a lot in the legal business. World is that people kind of you know, we just operate based on a handshake or I'll take your word for it, but then later on. Things aren't as clear as they were when we actually set them right like wait a second. I thought we agreed to this, but no I thought we agreed to that.",
      "Duration": 32,
      "Offset": 949
    },
    {
      "Sentence": "OK, well how are we going to know what was agreed to and then all of a sudden it's this whole dispute and that may or may not lead to you know worst case litigation and having to deal with it. For years and years in the courts and it's very expensive. The opposite end of the spectrum, which is also like not ideal, but you ruin. The Relationship and you lose that relationship and so instead. You know this isn't legal advice by any means, but as a general rule of some having.",
      "Duration": 31,
      "Offset": 982
    },
    {
      "Sentence": "Act in any type of business relationship certainly will benefit you as the business owner. As the podcast hose as you know the program director or a course developer or an instructor on that whatever it is, you're entering into a business relationship. My general recommendation is you want to. You want to make sure that it's in writing what the terms of the relationship are how will decisions be made if it is a partnership? How is compensation going to be?",
      "Duration": 32,
      "Offset": 1014
    },
    {
      "Sentence": "Money is changing hands and if services are being exchanged and then that way you can you know move forward and confidence and not have to worry about any type of miscommunication or disagreement or dispute cropping up and then of course, it's flexible like there isn't like and we're using this podcast is an example here Copyright. But certainly I wouldn't have to write it have it written rather in my favor. It could actually be something where the guest would say Hey, Scott wants to make sure that you know as my guess that you own your words and if you want to make T shirts of your words that.",
      "Duration": 31,
      "Offset": 1047
    },
    {
      "Sentence": "But you know like I could actually flip it around and make it so they'd be happy that they were sending it so that's actually the and that's a great point that you. Bring up Scott is that is actually the way I prefer to draft my contract with my clients and I don't do contract drafting so much anymore, but it used to be a significant part of my practice is that the contract is there and you should frame it this way when you're approaching so for example, within the context of this podcast. I'm presenting it to you because it's in both of our best interests.",
      "Duration": 30,
      "Offset": 1079
    },
    {
      "Sentence": "States what you know, my rights are what your rights are or what you know as we're entering into this business relationship. Your position in my position and a good contract should not harm one and benefit the other because we're obviously entering into this contract to move forward in a business relationship or some sort of relationship and so I'm not creating this contract. You know to disadvantage you. Instead, it should be to clearly state, the terms of our relationship.",
      "Duration": 32,
      "Offset": 1110
    },
    {
      "Sentence": "It clear what we're moving forward based on you know, and so you could and you should say in a contract like that. Just as a general of them is that you know, I you is the podcast. Guests are granting a license to the host to use your voice or your likeness or whatever it might be in connection with the promotional materials in connection with that podcasts and then also you is the guest maintain ownership over your.",
      "Duration": 32,
      "Offset": 1143
    },
    {
      "Sentence": "Contribution or however you end up stating it and yeah, just just sort of as an improper interesting.",
      "Duration": 5,
      "Offset": 1176
    },
    {
      "Sentence": "A big thank you to our sponsors because they make this show possible and I hope that you support them the way they support us.",
      "Duration": 6,
      "Offset": 1183
    },
    {
      "Sentence": "Progress software is the creator of the most comprehensive developer Toolkit for building modern apps on the market. Today, Telerik Dev craft with more than 1100 telerik.net and kendo. UI JavaScript components and controls you can easily build modern high performance web mobile and desktop apps as well as chat. Bots the tools that also includes reporting solutions. Automated testing and productivity tools and comes with a range of support options. New this year is a free online training program for all license holders with this alongside thousands of demos and source code available.",
      "Duration": 32,
      "Offset": 1189
    },
    {
      "Sentence": "Comprehensive documentation and a full assortment of Visual Studio templates. You'll be up and running with the Progress Telerik and kendo. UI controls in no time download a free 30 day trial today at telerik.com slash hanselman that'STLERIK.com hanselman.",
      "Duration": 18,
      "Offset": 1223
    },
    {
      "Sentence": "So you made that you made. This statement a couple times granting a license to so you always own your words 'cause you said. But you are allowing me to rebroadcast them. I've heard that before when I put things on Facebook or I put things in what I call walled gardens like owning a blog? Is my blog. I own the Copyright. I host it. It's my text and I own. The server so I own everything basically but Facebook. I type some words or even if I type like a chapter of a book that I haven't written yet.",
      "Duration": 32,
      "Offset": 1242
    },
    {
      "Sentence": "Just give them the entire chapter of the book I granted them a license to display it again is that correct yes. So I have not read Facebook's terms of use for the general idea, yeah, Yeah, but content generally if I am. Let's say. And this is my presumption with Facebook because I don't think Facebook could operate unless they did include the way it does unless they did include this type of license. I'm thinking that when we upload photos to Facebook or 2.",
      "Duration": 31,
      "Offset": 1275
    },
    {
      "Sentence": "Or or Instagram or any other type of an online platform where it is reproduced.",
      "Duration": 6,
      "Offset": 1306
    },
    {
      "Sentence": "We likely likely in the terms of use. They stay you as the user maintained Copyright ownership over your content because you must expressly transfer a Copyright to the other party right in order for them to become the owner of it, so use the original creator of that work you own the Copyright and you maintain the Copyright. However, you're granting Facebook or whatever platform. It is a license to reproduce it an otherwise.",
      "Duration": 31,
      "Offset": 1313
    },
    {
      "Sentence": "Not use Facebook, the way that we're using Facebook right so I share photos to Facebook. I maintain ownership. But in order for Facebook to be able to produce that on other individuals feeds and you know just online generally or in searches or however. It is that they work, they would need a license to be able to do that. And so, yeah, I'm thinking that's probably what takes place in there very long. Terms of use talking and I realize that it's unreasonable to expect you or anyone unless they are.",
      "Duration": 31,
      "Offset": 1345
    },
    {
      "Sentence": "Pacific lawyer, but I'm kind of using Facebook as a generic term for social media walled gardens in general. I think it's subtle like I don't think my non technical parents understand that there is an implicit.",
      "Duration": 12,
      "Offset": 1377
    },
    {
      "Sentence": "Terms of service for that you know, everyone just clicks OK on the terms of service and we don't realize that we have signed a Copyright over a trademark or by simply by simply passively using something.",
      "Duration": 10,
      "Offset": 1389
    },
    {
      "Sentence": "Is a little bit scary? Which also brings me to the question?",
      "Duration": 2,
      "Offset": 1401
    },
    {
      "Sentence": "Like if if if I need a lawyer to understand something. Maybe I shouldn't be using the thing at all trying to find that balance between being paralyzed with.",
      "Duration": 9,
      "Offset": 1405
    },
    {
      "Sentence": "Confusion about these things and versus being able to move through the digital world with confidence and then also whether or not. I want to just go to LegalZoom or one of these websites and go through a wizard.",
      "Duration": 10,
      "Offset": 1415
    },
    {
      "Sentence": "Or if I need to go and pay you know hundreds of thousands of dollars to talk to a lawyer. I realize these are all false equivalencies, but this can cause someone to kind of have analysis paralysis and then choose to basically do nothing so I guess my question is.",
      "Duration": 14,
      "Offset": 1427
    },
    {
      "Sentence": "I people who probably doing nothing and in doing that. Maybe not protecting themselves, Yeah. I think there's so many different aspects of this. Scott and you hit the nail on the head and there is analysis, paralysis when it comes to decision making in business is when it comes to their legal protections, and the legal foundation. I think it is somewhat of an intimidating process to begin. I know I need some legal advice. I know I'm not totally clear. I did a couple of Google searches and.",
      "Duration": 33,
      "Offset": 1442
    },
    {
      "Sentence": "We want to like Frankenstein, a whole contract for my business together based on what I can cut and paste. But you know how much? What kind of lawyer do. I even need? How much is it gonna cost you know? Is it going to cost me an arm and a leg. I don't have 10000 plus dollars to invest in a lawyer right now are legal services right now, so maybe I'll just do nothing and it's it's a really hard position to be in because.",
      "Duration": 27,
      "Offset": 1477
    },
    {
      "Sentence": "There isn't.",
      "Duration": 1,
      "Offset": 1505
    },
    {
      "Sentence": "With a lot of these things there aren't laws in place requiring you for example, as a business owner to take these steps you have to have a contract in place or you have to have your trademark protected or you have to file for a patent. There isn't there isn't anything requiring these individuals to do that, so they can continue to operate their business outside of that and then once it catches up to them that at that point. They have to hire a lawyer to defend them to develop their legal foundation to form an entity too.",
      "Duration": 30,
      "Offset": 1507
    },
    {
      "Sentence": "Whatever it might be right and so your question was at the first part of that question was you know How do I is it? Is it dangerous for me to just be using these different tools online or even Facebook you know something, as basic as face that is commonplace is Facebook if I don't understand the legal implications of clicking agree under their terms of use. When I create an account should I even be using it so again this is not legal advice just.",
      "Duration": 30,
      "Offset": 1539
    },
    {
      "Sentence": "Nothing in this podcast is legal advise purely for informational purposes. But just generally speaking, there is a there's a doctrine in contract law and it's all about unconscionability so the average person does not read through every single word, and in terms of use. I mean, I'm an attorney. And I do not read there. When my Apple Computer has an update which is like feels like every other day, it hasn't updated.",
      "Duration": 30,
      "Offset": 1570
    },
    {
      "Sentence": "I don't read through that I click agree and I move on and everything is fine and you know, I just hope for the best now if there were to be something for example, I'm you know, transferring ownership of my you know homestead in those terms or you know, I agreed to let them have my first born child in the event that I you know, whatever whatever the terms might say unconscionability means that that provision if it is not.",
      "Duration": 30,
      "Offset": 1601
    },
    {
      "Sentence": "Tour just or reasonable or if it's unreasonably excessive it will be disregarded so a court would not be enforced. Yeah, court. Weston Oregon, something yeah, once in a while. It updates things like OK. If you click OK, you've given Apple your car that's in constantly exactly yes exactly that's unreasonable you know the average person.",
      "Duration": 22,
      "Offset": 1633
    },
    {
      "Sentence": "Would not expect that to be within a software update right and so I mean. I can't guarantee that would be the case at every single contract may be reasonable reasonable minds may differ and that's why we have the courts work things like that out, but yeah, generally speaking, if I'm using Facebook or using Google or using some sort of software best practice absolute best practices to be clear on what it is, you're agreeing to and certainly if you're entering into.",
      "Duration": 31,
      "Offset": 1655
    },
    {
      "Sentence": "Long term commitment or a long term business relationship. You wanna be clear on what those terms are that you're agreeing to and having a lawyer review that contract is a great decision to make just because a lawyer can decide for you know what is in all this fine? What are what will be required of me as a party in this agreement. But if this is just a general terms of use that it's a software license or creating an account on.",
      "Duration": 30,
      "Offset": 1687
    },
    {
      "Sentence": "Platform I wouldn't be paralyzed from fear of you know, agreeing to their terms of use. Yeah, just something to keep in mind. Another thing that we were talking about before hand that I wanted to cover in this show was the idea. If I'm working on a project and I'm like a small business and then I'm hiring. Other small businesses to make me like a logo or write me punch up some text or something like that? Do I pay you and you make me a logo and then you email me the logo.",
      "Duration": 32,
      "Offset": 1718
    },
    {
      "Sentence": "Did you on the logo? Do I own the logo? But if it's unseen the assumption? Is I just paid you I own. The logo, but you could come back 10 years from now and say, yeah, I made that logo. Yeah, he paid me but I still own it, or if I hire someone to take photos they own them right. They could still sell them again. Yes, exactly and that is something that so many business owners. Just don't understand and aren't familiar with this concept of work for hire in terms of Copyright ownership and so, if I hired a designer to develop a logo for me.",
      "Duration": 31,
      "Offset": 1751
    },
    {
      "Sentence": "Author of that design that graphic design and so even though I paid them to provide me with the logo I might have provided them with all the inspiration necessary to develop the design. They still have created it themselves and so they maintain Copyright ownership of it and that means they have that bundle of sticks that were talking about of Rights and so they could license it to others. They could tweak it and create derivative works based on it, and by providing it to me and buy my hiring of them. I have sort of an implied license to the use of it.",
      "Duration": 33,
      "Offset": 1784
    },
    {
      "Sentence": "Still, able to turn around and that's what I see a lot of people experiencing and they're like, what the hell like I didn't say you could sell that to somebody else but the designer will turn around and sell that design to another business for them to use as their logo and so it's really important to make sure that when you are hiring someone to develop some work of art authorship. So maybe I hire a copywriter to develop written blogs for my website. Maybe I hire a photographer to develop photos or videographer to shoot video footage or a graphic designer to develop some graphic designs.",
      "Duration": 31,
      "Offset": 1818
    },
    {
      "Sentence": "Is a Copyright transfer agreement that is signed that clearly and expressly transfers ownership of it and that way you are the one that owns it and are able to license it to others are able to reproduce it are able to use in any which way you wish instead of being limited by the ownership of another interesting. The thing that was most ignorant about what you said there was the idea of implicit versus explicit is an implicit license and we can all assume that. But if it doesn't get written down, it's not real.",
      "Duration": 31,
      "Offset": 1850
    },
    {
      "Sentence": "Copyright ownership a transfer of the rights must be explicit, it must be expressed. We can't assume that however. When I hire you to take photos it can be implied that I intend to use that right otherwise. I wouldn't have hired you but it can't be implied that the Copyright ownership is being transferred to me unless we have that in writing and agreed to by both parties and this gets to the root of what we",
      "Duration": 30,
      "Offset": 1882
    },
    {
      "Sentence": "About where people are just counting on handshakes. They're counting on assumptions are counting on implicit rights. Yes, yeah, that's that's where it gets to be problematic specifically when it comes to trademark law and protection of your trademark assets. A lot of people think well. You know, I hired someone to develop my logo or my my whole brand identity based on this name or based on this inspiration that I provided them.",
      "Duration": 31,
      "Offset": 1912
    },
    {
      "Sentence": "They said it should be fine. They haven't seen anything like it and they move forward based on that sort of blind faith. I guess and I'm not really. Sure, why they would, but I guess it's a matter of you don't know what you don't know right and when you don't know what you don't know you don't even know what questions to ask you don't know where to look. You don't know who to consult with so I see a lot of people within the trademark space doing is they'll move forward and develop their whole business and their whole brand based on a name based on a product name based on a slogan or a logo or whatever it might be.",
      "Duration": 32,
      "Offset": 1944
    },
    {
      "Sentence": "They get hit with a cease and assist or they get hit with an infringement lawsuit because somebody else is already using a name that is similar to it and just because it's not exactly the same doesn't mean there isn't a situation of possible situation of infringement. There so it's something to keep in mind. I appreciate that, well thanks. So much for chatting with me today and people can engage with you right at Y SHfirm.com and you can advise them and this is literally what you do what you've talked about with me on the show about getting people started making sure that they are protected in their successful than their startups is literally what you do.",
      "Duration": 33,
      "Offset": 1978
    },
    {
      "Sentence": "Then it would be my pleasure. Thank you for having me Scott Fantastic. I've been talking with Yasmine Salem Hamdan and this has been another episode of Hanselman's and we'll see you again next week.",
      "Duration": 13,
      "Offset": 2012
    }
  ]
}